LonelyWolf/stm32/bike-computer/main.c
///////////////////
// STM32L151RBT6 //
///////////////////


/////////////////////////////////////////////////////////////////////////

#define DEBUG

/////////////////////////////////////////////////////////////////////////


#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>
#include <stm32l1xx_rtc.h>
#include <stm32l1xx_exti.h>
#include <stm32l1xx_syscfg.h>
#include <string.h> // For memset, memmove
#include <misc.h>

#include <wolk.h>
#include <delay.h>
#include <spi.h>
#include <i2c.h>
#include <uart.h>
#include <uc1701.h>
#include <nRF24.h>
#include <bmp180.h>
#include <RTC.h>
#include <GUI.h>
#include <GPS.h>
#include <USB.h>
#include <beeper.h>
#include <spi1.h>
#include <sdcard.h>
#include <log.h>

#include <font5x7.h>
#include <font7x10.h>
#include <resources.h>


/////////////////////////////////////////////////////////////////////////


#define SCREENSAVER_TIMEOUT           1800  // Timeout for screensaver activation (seconds)
#define SCREENSAVER_UPDATE              60  // Screensaver update interval (seconds)
#define ALT_MEASURE_DUTY_CYCLE          30  // Temperature/pressure measurement duty cycle (seconds)
#define NO_SIGNAL_TIME                  10  // Sensor signal timeout (seconds)
#define GPS_TIME_SYNC_DUTY_CYCLE       120  // Duty cycle to sync system time tiwh GPS time (seconds)


/////////////////////////////////////////////////////////////////////////


uint8_t nRF24_RX_Buf[nRF24_RX_PAYLOAD];     // nRF24L01 payload buffer

bool _new_packet;                           // TRUE if new packet was received but not parsed
bool _new_time;                             // TRUE if time was updated
bool _bmp180_present;                       // TRUE if BMP180 sensor responded on I2C bus
bool _RF_icon;                              // Flag for RF icon flashing

RTC_TimeTypeDef _time;                      // Temporary structure for time
RTC_DateTypeDef _date;                      // Temporary structure for date

uint16_t _prev_cntr_SPD;                    // Last received cntr_SPD value
uint16_t _prev_tim_SPD;                     // Last received tim_SPD value
uint16_t _tim_excess;                       // Timer excess from 1 second ratio
uint32_t _cntr_cadence;                     // Cadence counter (for AVG calculation)
uint32_t _cadence_accum;                    // Cadence accumulator (for AVG calculation)
uint32_t _GPS_time_duty_cycle;              // Duty cycle to sync system time with GPS time
uint32_t _altitude_duty_cycle;              // Altitude measurement duty cycle

int16_t altitude_history[128];              // Last 128 altitude values

uint16_t _DMA_cntr;                         // Last value of UART RX DMA counter (to track RX timeout)

uint32_t i,j;                               // THIS IS UNIVERSAL VARIABLES
uint32_t ccc;                               // Wake-ups count, for debug purposes


/////////////////////////////////////////////////////////////////////////


void ParsePacket(void);
void ParseGPS(void);
bool UpdateBMP180(void);


/////////////////////////////////////////////////////////////////////////


// Configure the different system clocks
void RCC_Configuration(void) {
	RCC_AHBPeriphClockCmd(
			RCC_AHBPeriph_GPIOA |     // PORTA
			RCC_AHBPeriph_GPIOC,      // PORTC
			ENABLE);

	RCC_APB1PeriphClockCmd(
			RCC_APB1Periph_TIM7,      // TIM7 peripheral (DMA timeout check)
			ENABLE);

	RCC_APB2PeriphClockCmd(
			RCC_APB2Periph_SYSCFG,    // System configuration controller
			ENABLE);
}

// Configure pins
void GPIO_Configuration(void) {
	GPIO_InitTypeDef PORT;

	// Charge STAT pin (PA15)
	PORT.GPIO_Mode  = GPIO_Mode_IN;
	PORT.GPIO_Speed = GPIO_Speed_2MHz;
	PORT.GPIO_PuPd  = GPIO_PuPd_UP;
	PORT.GPIO_Pin   = GPIO_Pin_15;
	GPIO_Init(GPIOA,&PORT);

	// Button#0 (PA5)
	PORT.GPIO_Mode = GPIO_Mode_IN;
	PORT.GPIO_PuPd = GPIO_PuPd_UP;
	PORT.GPIO_Pin  = BTN0_PIN;
	GPIO_Init(BTN0_PORT,&PORT);

	// Button#1 (PA7)
	PORT.GPIO_Pin  = BTN1_PIN;
	GPIO_Init(BTN1_PORT,&PORT);

	// Button#2 pin (PC10)
	PORT.GPIO_Pin  = BTN2_PIN;
	GPIO_Init(BTN2_PORT,&PORT);

	// Button#3 pin (PC11)
	PORT.GPIO_Pin  = BTN3_PIN;
	GPIO_Init(BTN3_PORT,&PORT);
}

// Configure the interrupt controller
void NVIC_Configuration(void) {
	NVIC_InitTypeDef NVICInit;
	EXTI_InitTypeDef EXTIInit;

	// Configure priority group: 4 bits for preemption priority, 0 bits for subpriority.
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

	// TIM7 IRQ (USART DMA timeout control)
	NVICInit.NVIC_IRQChannel = TIM7_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0e; // lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);

	// PC6 -> EXTI line 6 (nRF24L01 IRQ)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource6);
	EXTIInit.EXTI_Line = EXTI_Line6;
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);

	// EXTI9_5 interrupt
	NVICInit.NVIC_IRQChannel = EXTI9_5_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x00; // highest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);

	// EXTI15_10 interrupt
	NVICInit.NVIC_IRQChannel = EXTI15_10_IRQn;
	NVIC_Init(&NVICInit);

	// PA5 -> EXTI line 5 (Button#0)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource5);
	EXTIInit.EXTI_Line = EXTI_Line5;
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 10  (Button#2)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource10);
	EXTIInit.EXTI_Line = EXTI_Line10;
	EXTI_Init(&EXTIInit);

	// PC10 -> EXTI line 11  (Button#3)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource11);
	EXTIInit.EXTI_Line = EXTI_Line11;
	EXTI_Init(&EXTIInit);

	// PC12 -> EXTI line 12  (Button#1)
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC,EXTI_PinSource12);
	EXTIInit.EXTI_Line = EXTI_Line12;
	EXTI_Init(&EXTIInit);

