LonelyWolf/stm32/bike-computer/main.c
	// RTC wake-up -> EXTI line 20
	EXTIInit.EXTI_Line = EXTI_Line20;
	EXTIInit.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTIInit.EXTI_Trigger = EXTI_Trigger_Rising; // Must be rising edge
	EXTIInit.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTIInit);
	NVICInit.NVIC_IRQChannel = RTC_WKUP_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);
}

// Initialize display:
//   - turn on and configure peripheral
//   - set backlight level
//   - set contrast
//   - set orientation
void Display_Init(void) {
	UC1701_Init();
	UC1701_Contrast(4,24);
	UC1701_Orientation(scr_normal);
	UC1701_SetBacklight(Settings.LCD_brightness);
}

// Configure peripherals
void InitPeripherals(void) {
	RCC_Configuration();
	GPIO_Configuration();
	NVIC_Configuration();

	// Initialize buzzer out
	BEEPER_Init();

	// Initialize delay timer without callback function
	Delay_Init(NULL);

	// UART port initialization
	UART2_Init(9600); // Use slow speed at startup

	// USB port initialization
//	USB_Init();

	// Configure basic timer TIM7 (for DMA timeout)
	TIM7->CR1  |= TIM_CR1_ARPE; // Auto-preload enable
	TIM7->PSC   = SystemCoreClock / 16000; // prescaler
	TIM7->ARR   = 999; // auto reload value
	TIM7->EGR   = 1; // Generate an update event to reload the prescaler value immediately
	TIM7->DIER |= TIM_DIER_UIE; // Enable TIMx interrupt

	// SPI2 port initialization (display and nRF24)
	SPI2_Init();

	// SPI1 port initialization (SD card)
	SPI1_Init();

	// Initialize and configure LCD
	Display_Init();
}

// Turn on transceiver and configure it for RX mode
void nRF24_SetRXMode(void) {
	nRF24_Wake();
	nRF24_RXMode(
			nRF24_RX_PIPE0,           // RX on PIPE#0
			nRF24_ENAA_OFF,           // Auto acknowledgment
			nRF24_RF_CHANNEL,         // RF Channel
			nRF24_DataRate_250kbps,   // Data rate
			nRF24_CRC_on,             // CRC
			nRF24_CRC_1byte,          // CRC scheme
			(uint8_t *)nRF24_RX_Addr, // RX address
			nRF24_RX_Addr_Size,       // RX address size
			nRF24_RX_PAYLOAD,         // Payload length
			nRF24_TXPower_0dBm        // TX power for auto acknowledgment
			);
    nRF24_ClearIRQFlags();
    nRF24_FlushRX();
}

// Turn off transceiver
void nRF24_Sleep(void) {
	nRF24_PowerDown();
}

// Inquiry status of the button
void Button_Inquiry(BTN_TypeDef *button) {
	if (button->PORT->IDR & button->PIN) {
	    // Button released
		button->hold_cntr = 0;
		if (button->state != BTN_Hold) button->cntr++;
		button->state = BTN_Released;
	} else {
		// Button pressed
		button->hold_cntr = 0;
		button->state = BTN_Pressed;
		BEEPER_Enable(2000,5);
	}
	if (!_screensaver) UC1701_SetBacklight(Settings.LCD_brightness);
	_screensaver = FALSE;
	_idle_time = 0;
}


/////////////////////////////////////////////////////////////////////////


// EXTI[5..9] lines IRQ handler
void EXTI9_5_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;

	if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
		// EXTI6 (nRF24L01 IRQ)
		UC1701_PauseSPI();
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		nRF24_ClearIRQFlags();
		UC1701_ResumeSPI();
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			ParsePacket();
			_no_signal_time = 0;
			if (_idle_time > Settings.LCD_timeout) _idle_time = Settings.LCD_timeout; // FIXME: with this enabled no menu/GUI timeout will happen
			BEEPER_Enable(4000,1);
		} else BEEPER_Enable(300,1);
		EXTI_ClearITPendingBit(EXTI_Line6);
	}

	if (EXTI_GetITStatus(EXTI_Line5) != RESET) {
		// EXTI5 (Button#1 -> "Up")
		Button_Inquiry(&BTN[BTN_UP]);
		EXTI_ClearITPendingBit(EXTI_Line5);
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line10) != RESET) {
		// EXTI10 (Button#3 -> "Enter")
		Button_Inquiry(&BTN[BTN_ENTER]);
		EXTI_ClearITPendingBit(EXTI_Line10);
	}

	if (EXTI_GetITStatus(EXTI_Line11) != RESET) {
		// EXTI11 (Button#4 -> "Escape")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI_ClearITPendingBit(EXTI_Line11);
	}

	if (EXTI_GetITStatus(EXTI_Line12) != RESET) {
		// EXTI12 (Button#2 -> "Down")
		Button_Inquiry(&BTN[BTN_DOWN]);
		EXTI_ClearITPendingBit(EXTI_Line12);
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt
		RTC_GetDateTime(&RTC_Time,&RTC_Date);

		_no_signal_time++;
		_GPS_time_duty_cycle++;
		_altitude_duty_cycle++;
		_idle_time++;
		_new_time = TRUE;

		// Counters overflow protection  FIXME: is it really necessary?
		if (_no_signal_time > 36000) _no_signal_time = 36000;
		if (_idle_time > 36000) _idle_time = 36000;
		if (_GPS_time_duty_cycle > 36000) _GPS_time_duty_cycle = 36000;
		if (_altitude_duty_cycle > 36000) _altitude_duty_cycle = 36000;

		if (_no_signal_time > NO_SIGNAL_TIME) {
			CurData.Speed   = 0;
			CurData.Cadence = 0;
			_prev_cntr_SPD  = 0;
		}
		if (_idle_time > SCREENSAVER_TIMEOUT) _screensaver = TRUE; else _screensaver = FALSE;
		if (!_screensaver) {
			// The following procedures must be executed only when no screensaver active
			if (_idle_time > Settings.LCD_timeout && Settings.LCD_timeout) UC1701_SetBacklight(0); else UC1701_SetBacklight(Settings.LCD_brightness);
			// ATTENTION! BMP180 polling pretty slow!
			// Execute it from this place is really a bad idea!
			if (_bmp180_present && _altitude_duty_cycle > ALT_MEASURE_DUTY_CYCLE) UpdateBMP180();
		}

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled
		EXTI_ClearITPendingBit(EXTI_Line20);
	}
}

// TIM7 IRQ handler
void TIM7_IRQHandler(void) {
	TIM7->SR &= ~TIM_SR_UIF; // Clear the TIM7's interrupt pending bit (TIM7 rises only UPDATE IT)
//	TIM7->SR = (uint16_t)~TIM_IT_Update; // Clear the TIM7's interrupt pending bit (TIM7 rises only UPDATE IT)
	if (_DMA_cntr == (uint16_t)DMA1_Channel6->CNDTR) {
		// DMA pointer unchanged from last IRQ -> UART timeout
		TIM7->CR1 &= (uint16_t)(~((uint16_t)TIM_CR1_CEN)); // Disable TIM7
		DMA1_Channel6->CCR &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA
		// Copy rest of data from the FIFO buffer to the GPS buffer
		_DMA_cntr = FIFO_BUFFER_SIZE - (uint16_t)DMA1_Channel6->CNDTR;
		// Cut data buffer to prevent overflow
		if (GPS_buf_cntr + _DMA_cntr >= GPS_BUFFER_SIZE) _DMA_cntr = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],USART_FIFO,_DMA_cntr);
		GPS_buf_cntr += _DMA_cntr;
		_DMA_cntr = 0;
		ParseGPS(); // About 3ms with full buffer
		// Enable USART2 RX complete interrupt when GPS data is parsed (ready to get new)
		UART_PORT->CR1 |= USART_CR1_RXNEIE;
	} else {
		// Data still coming from USART
		_DMA_cntr = (uint16_t)DMA1_Channel6->CNDTR;
	}
}

