LonelyWolf/stm32/bike-computer/main.c
// USART2 IRQ handler
void USART2_IRQHandler(void) {
	if (UART_PORT->SR & USART_SR_RXNE) {
//	if (UART_PORT->SR & USART_IT_RXNE) {
		// Received data ready to be read
		UART_PORT->CR1 &= ~USART_CR1_RXNEIE; // Disable USART2 RX complete interrupt
		DMA1_Channel6->CCR &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA (it should be disabled though)
		DMA1_Channel6->CNDTR = FIFO_BUFFER_SIZE;
		DMA1_Channel6->CCR  |= DMA_CCR6_EN; // Enable DMA
		TIM7->CNT  = 0;
		TIM7->CR1 |= TIM_CR1_CEN; // Enable TIM7
	}
}


// UART2_RX DMA IRQ handler
void DMA1_Channel6_IRQHandler() {
	uint16_t b_rcvd;

	if (DMA1->ISR & DMA_ISR_TCIF6) {
		// Channel 6 transfer complete
		DMA1->IFCR |= DMA_IFCR_CTCIF6; // Clear DMA1 channel6 transfer complete flag
		// Amount of received data (in fact should be equal to FIFO_BUFFER_SIZE)
		b_rcvd = FIFO_BUFFER_SIZE - (uint16_t)DMA1_Channel6->CNDTR;
		// Prevent data buffer overflow
		if (GPS_buf_cntr + b_rcvd >= GPS_BUFFER_SIZE) b_rcvd = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],USART_FIFO,b_rcvd); // Copy data to the GPS buffer
		GPS_buf_cntr += b_rcvd;
		DMA1_Channel6->CCR &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA (for reload counter value)
		DMA1_Channel6->CNDTR = FIFO_BUFFER_SIZE; // Reload DMA counter
		// If the data buffer is full the DMA should remain disabled until the buffer is processed.
		if (GPS_buf_cntr <= GPS_BUFFER_SIZE) DMA1_Channel6->CCR  |= DMA_CCR6_EN; // Enable DMA
	};
}


/////////////////////////////////////////////////////////////////////////


// Callback function for delay timer overflow IRQ
void callback_Delay(void) {
	uint8_t i;

	// Check if a buttons is in hold state
	for (i = 0; i < 4; i++) {
		if (!(BTN[i].PORT->IDR & BTN[i].PIN)) {
			BTN[i].hold_cntr++;
			if (BTN[i].hold_cntr > 3) BTN[i].state = BTN_Hold;
		}
	}

	// Set GUI refresh flag (twice per second)
	GUI_refresh = TRUE;
}


/////////////////////////////////////////////////////////////////////////


// Parse received nRF24L01 data packet
void ParsePacket(void) {
	uint32_t diff_SPD;

	// memcpy doesn't work here due to struct alignments
	nRF24_Packet.cntr_SPD     = (nRF24_RX_Buf[0] << 8) + nRF24_RX_Buf[1];
	nRF24_Packet.tim_SPD      = (nRF24_RX_Buf[2] << 8) + nRF24_RX_Buf[3];
	nRF24_Packet.tim_CDC      = (nRF24_RX_Buf[4] << 8) + nRF24_RX_Buf[5];
	nRF24_Packet.vrefint      = ((nRF24_RX_Buf[6] & 0x03) << 8) + nRF24_RX_Buf[7];
	nRF24_Packet.cntr_wake    = (nRF24_RX_Buf[8] << 8) + nRF24_RX_Buf[9];

	// Convert SPD impulses period into speed
	if (nRF24_Packet.tim_SPD > 0) {
//		CurData.Speed = Settings.WheelCircumference * (992.9696969 * 0.36) / nRF24_Packet.tim_SPD;
//		CurData.Speed = (Settings.WheelCircumference * 357.469090884) / nRF24_Packet.tim_SPD;
//		CurData.Speed = Settings.WheelCircumference * (1007.08 * 0.36) / nRF24_Packet.tim_SPD;
		CurData.Speed = (Settings.WheelCircumference * 362.5488) / nRF24_Packet.tim_SPD;
		if (CurData.Speed > 999) CurData.Speed = 999; // Maximum 99.9km/h can be displayed
	} else CurData.Speed = 0;

	// Convert CDC impulses period into cadence
	if (nRF24_Packet.tim_CDC > 0) {
//		CurData.Cadence = (uint32_t)((60.0 / nRF24_Packet.tim_CDC) * 992.9696969);
//		CurData.Cadence = (uint32_t)(59578.181814 / nRF24_Packet.tim_CDC);
//		CurData.Cadence = (uint32_t)((60.0 / nRF24_Packet.tim_CDC) * 1007.08);
		CurData.Cadence = (uint32_t)(60424.8 / nRF24_Packet.tim_CDC);
//		if (CurData.Cadence > 250) CurData.Cadence = 250; // pedaling 250RPM, really?
		// FIXME: filter some crazy high values
		if (CurData.Cadence > 999) CurData.Cadence = 999; // pedaling more than 999RPM, really?
	} else CurData.Cadence = 0;

	// Update maximum values
	if (CurData.Speed > CurData.MaxSpeed) CurData.MaxSpeed = CurData.Speed;
	if (CurData.Cadence > CurData.MaxCadence) CurData.MaxCadence = CurData.Cadence;

	// Update current trip time
	// Transceiver send packet every second, so don't fuss and simply add one second to trip time
	CurData.TripTime++;
/*
 		if (nRF24_Packet.tim_SPD != _prev_tim_SPD) {
		if (nRF24_Packet.tim_SPD < 1007) {
			// Pulse interval was shorter than one second therefore just
			// add one second to the trip counter
			CurData.TripTime++;
		} else {
			// Pulse interval was longer than one second, therefore convert it
			// to seconds and remember fractional part for further usage
			tmp = (nRF24_Packet.tim_SPD / 1007.08) + (_tim_excess / 1000.0);
			CurData.TripTime += (uint32_t)tmp;
			_tim_excess = (uint32_t)(tmp * 1000) - ((uint32_t)tmp * 1000);
		}
	}
	_prev_tim_SPD  = nRF24_Packet.tim_SPD;
*/
/*
	if (nRF24_Packet.ride_time) {
		tmp = (nRF24_Packet.ride_time / 1007.08) + (_tim_excess / 1000.0);
		CurData.TripTime += (uint32_t)tmp;
		_tim_excess = (uint32_t)(tmp * 1000) - ((uint32_t)tmp * 1000);
	}
*/

	// Update odometer and current trip distance
	if (nRF24_Packet.cntr_SPD != 0 && nRF24_Packet.cntr_SPD != _prev_cntr_SPD) {
		if (nRF24_Packet.cntr_SPD >= _prev_cntr_SPD) {
			diff_SPD = nRF24_Packet.cntr_SPD - _prev_cntr_SPD;
		} else {
			diff_SPD = 65535 - _prev_cntr_SPD + nRF24_Packet.cntr_SPD;
		}
//		if (diff_SPD > 50) diff_SPD = 1; // FIXME: this lame workaround for crazy values
		CurData.dbg_spd_cntr += diff_SPD;
		CurData.dbg_cntr_diff = diff_SPD;
		CurData.Odometer += Settings.WheelCircumference * diff_SPD;
		CurData.TripDist += Settings.WheelCircumference * diff_SPD;
	} else {
		CurData.dbg_cntr_diff = 0;
	}
	_prev_cntr_SPD = nRF24_Packet.cntr_SPD;
	CurData.dbg_prev_cntr = _prev_cntr_SPD;

	// Update average values
	CurData.AvgSpeed = (uint32_t)((CurData.TripDist * 0.36) / CurData.TripTime);
	if (CurData.Cadence > 0) {
		// A simple calculation of the average cadence.
		_cntr_cadence++;
		// At constant value of cadence 300RPM this accumulator will overflow
		// after about 4000 hours of ride
		_cadence_accum += CurData.Cadence;
		CurData.AvgCadence = _cadence_accum / _cntr_cadence;
	}

	_new_packet = TRUE;
}

// Parse GPS data
void ParseGPS(void) {
	GPS_InitData(); // Clear previously parsed GPS data
	while (GPS_msg.end < GPS_buf_cntr) {
		GPS_msg = GPS_FindSentence(GPS_buf,GPS_msg.end,GPS_buf_cntr);
		if (GPS_msg.type != NMEA_BAD) {
			GPS_sentences_parsed++;
			GPS_ParseSentence(GPS_buf,&GPS_msg);
		} else GPS_sentences_unknown++;
	}
	GPS_buf_cntr = 0;
	if (GPS_sentences_parsed) {
		GPS_CheckUsedSats();
		if (GPSData.fix == 3) {
			// GPS altitude makes sense only in case of 3D fix
			CurData.GPSAlt = GPSData.altitude;
			if (CurData.GPSAlt > CurData.MaxGPSAlt) CurData.MaxGPSAlt = CurData.GPSAlt;
			if (CurData.GPSAlt < CurData.MinGPSAlt) CurData.MinGPSAlt = CurData.GPSAlt;
		}
		if (GPSData.fix == 2 || GPSData.fix == 3) {
			// GPS speed makes sense only in case of 2D or 3D position fix
			CurData.GPSSpeed = GPSData.speed;
			if (CurData.GPSSpeed > CurData.MaxGPSSpeed) CurData.MaxGPSSpeed = CurData.GPSSpeed;
		}
		GPS_new_data = TRUE;
	}
}

